2022-07/physics-based-dl/run/hyperparameter_dnnPotentialFoam/unit_box_domain/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    p
    {
        $Phi;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

AI
{
    // Uncomment when parameterizing
    // via the dictionary.
    maxIterations 50000;
    hiddenLayers (30 30 30 30 30);
    optimizerStep 1e-04;

//    sphere
//    {
//        radius 0.25;
//        center (0.5 0.5 0.5);
//    }
}


// ************************************************************************* //
